<center><h1>BUSS6002 - Data Science in Business</h1></center>

#### Pre-Tutorial Checklist

1. Complete Tasks 1 and 2 from Week 4
2. Create an account with ElephantSQl https://customer.elephantsql.com/signup'
3. Install psycopg2 package, if you need help watch the pencast titled “Installing libraries”


# Tutorial 5 - Databases

In this tutorial we will work with data not stored on our computer in a CSV or Excel file, but rather on a database  only accesible via the network. The majority of large businesses will store their data in a database on a single large server or a cluster of servers.

## PostgreSQL

Today we will work with PostgreSQL databases. PostgreSQL (often just called "Postgres") is one of many "SQL" database systems available. We use it today for the following reasons:

- Ubiquity, postgres databases are everywhere in the real world
- Free and Open Source
- Stability, postgres is over 20 years old today
- Well supported with documentation

There are many other choices such as MySQL, MariaDB, Oracle etc that behave in a similar way which you might encounter.

## ElephantSQL

For this tutorial we will use ElephantSQL https://www.elephantsql.com. ElephantSQL is an online PostgreSQL service. They provide small and free PostgreSQL databases. 

Please go to https://customer.elephantsql.com/signup and create an account.

## Creating a Database

Once you have logged in, click "Create New Instance" to create a new database.

<img width=400px src="img/create.png">

Next steps:

1. Give the database a name e.g. "BUSS6002 Tutorial"
2. Select "Tiny Turtle (Free)" as the plan
3. Select a region (this doesn't really matter, the default is fine)
4. Confirm

## Viewing Database details

After creating your database, click on it's name in the list of "Instances". It will take you to the details page for your new database. For example

<img width=400px src="img/details.png">

Glossary:

- **Server**: the address (hostname) of the server that holds your database
- **User and Default database**: this is both the name of the database that you created and the database user who has permission to modify the database. Since this is a shared database environment ElephantSQL assigns you a unique database name that is different from your "Instance" name.
- **Password**: the password to use when connecting to the database
- **URL**: this is a string that we can use to securely connect to our database that contains all the required credentials. The format is:
    
        postgresql://USER_NAME:PASSWORD@SERVER:PORT/DATABASE_NAME

By default the port is 5432.

# Connecting to a Postgres Database

## Install psycopg2

To connect to a remote database we can use the psycopg library. First install it by running the following command in your system's Terminal or Command Prompt:

    conda install psycopg2

<div style="margin-bottom: 0px;"><img width=20 style="display: block; float: left;  margin-right: 20px;" src="img/docs.png"> <h3 style="padding-top: 0px;">Documentation - psycopg2 Usage</h3></div>
http://initd.org/psycopg/docs/usage.html


## Make a connection

We need to first create a connection to the database

In [ ]:
# 1. sign up an account in elephant SQL database
# 2. install the conda install psycopg2 in your computer
# 3. fill the information in the below code and run it

In [2]:
import psycopg2

connection = psycopg2.connect(dbname="qasdhxmx",
                               user="qasdhxmx",
                               password="x256j2diCf2YgLctuIMMdaiSYORXf-3H",
                               host="salt.db.elephantsql.com",
                               port=5432)
# this is your connection to the server
print(connection)

<connection object at 0x7f56303837d0; dsn: 'user=qasdhxmx password=xxx dbname=qasdhxmx host=salt.db.elephantsql.com port=5432', closed: 0>

# Creating a Table

Relational Databases such as Postgres store their data in one or more Tables. Before we can perform any queries or store any data we must define the structure of a table.

In this simple example we are going to create a table with three columns:
- id, a unique identifier for each user
- username, the username
- role, the users job title 

For each column you must specify the datatype. For example the id column is an integer of max length 6. varchar data type is similar to a String in other programming languages.

``` mysql
CREATE TABLE IF NOT EXISTS users (
  id integer NOT NULL,
  username varchar NOT NULL,
  role varchar NOT NULL,
  PRIMARY KEY (id)
);
```

<div style="margin-bottom: 0px;"><img width=20 style="display: block; float: left;  margin-right: 20px;" src="img/docs.png"> <h3 style="padding-top: 0px;">Documentation - postgres CREATE TABLE</h3></div>
https://www.postgresql.org/docs/9.1/sql-createtable.html

In [4]:
# this is a SQL to create a table
# CREATE TABLE: create table
# IF NOT EXISTS users: 
    # user: table name
    # IF NOT EXSITS: this table only created when there is not previous recorded 
    # for some SQL, it would overwrite the table 
    # for some, it would report a error
    # for some, simply do nothing.
    
create_qry = """CREATE TABLE IF NOT EXISTS users (
                  id integer NOT NULL,
                  username varchar NOT NULL,
                  role varchar NOT NULL,
                  PRIMARY KEY (id)
                );"""

# id, username and role are nothing special ! they just column names"
# name type condition
# PRIMARY KEY (id) makes id to be indentifier and unique and the key of table
# NOT NULL: everytime you want to insert some instance, all of this three values should be filled 
# normally one table can only have 1 primary key!
# varchar is string, integer is int

# Get a cursor
# cursor is the object to send your SQL to the server via python
cursor = connection.cursor()

# Create the table
cursor.execute(create_qry)

<div style="margin-bottom: 30px;"><img width=48 style="display: block; float: left;  margin-right: 20px;" src="img/question-mark-button.png"> <h3 style="padding-top: 15px;">Exercise 1 - Creating Tables</h3></div>

1. What does the command "IF NOT EXISTS" do or change about our query?
2. What is the equivalent Python data type of varchar?
3. What does "PRIMARY KEY (id)" mean? What implication does it have for ``id``?

# Cursors

A cursor points to the part of the database we are interacting with. All database interactions must go through the cursor. The reason for this from the documentation

    ```Rather than executing a whole query at once, it is possible to set up a cursor that encapsulates the query, and then read the query result a few rows at a time. One reason for doing this is to avoid memory overrun when the result contains a large number of rows.```

https://www.postgresql.org/docs/9.2/plpgsql-cursors.html

# Inserting Data

To insert data you can use the INSERT INTO command. You need to specify which table you are inserting data into and which columns you are setting. Here we are inserting data into the users table for all the columns.

``` sql
INSERT INTO users (id, username, role) VALUES ('1', 'Kelvin', 'Tutor')
```

In [18]:
connection.rollback() # this is a magic code to save your life, I would explain it later! don't run it just leave!

In [19]:
# insterting via a simple ()

# insert is for inserting the data instance for SQL
# ON CONFLICT DO NOTHING means if this line has been inserted, we do not do anything
insert_qry = "INSERT INTO users (id, username, role) VALUES (%s, %s, %s) ON CONFLICT DO NOTHING"

# excute the sql with the actual values
# actual value is ('1', 'Kelvin', 'Tutor')
cursor.execute(insert_qry, ('1', 'Kelvin', 'Tutor'))

### Inserting a Dictionary

In [20]:
# inserting via a dictionary
# trying to insert the instance with a dictionary 
insert_qry = "INSERT INTO users (id, username, role) VALUES (%(id)s, %(username)s, %(role)s) ON CONFLICT DO NOTHING"

# dict: {key: value}
kelvin_dict = {
    'id': 2,
    'username': 'Tina',
    'role': 'Tutor'
}

# Get a cursor
cursor = connection.cursor()
cursor.execute(insert_qry, kelvin_dict)

## Multiple Inserts

<div style="margin-bottom: 0px;"><img width=20 style="display: block; float: left;  margin-right: 20px;" src="img/docs.png"> <h3 style="padding-top: 0px;">Documentation - psycopg2 execute_values</h3></div>
http://initd.org/psycopg/docs/extras.html#psycopg2.extras.execute_values

``` mysql
INSERT INTO users (id, username, role) VALUES
  ('3', 'Jess', 'Tutor'),
  ('4', 'Jie', 'Lecturer');
```

In [13]:
from psycopg2.extras import execute_values

# EXCUTE_VALUES is for excute multiple instances in the one time!

insert_qry = "INSERT INTO users (id, username, role) VALUES %s ON CONFLICT DO NOTHING"

# correspondingly you can create multiple data instances
data = [
    ('3', 'Jess', 'Tutor'),
    ('4', 'Jie', 'Lecturer')
]

# Get a cursor
cursor = connection.cursor()
execute_values(cursor, insert_qry, data)

# Transactions

Postgres supports the concept of transactions. A Transaction is a list of changes to the database that must happen together. In other words a transction is used to encapsulate an atomic change to the database.

For example if we have a database of bank customers and Alice wants to send Bob $100. There are two steps:
1. Subtract 100 from Alice's account
2. Add 100 to Bob's account

If there is a failure in between steps 1 and 2, maybe because Alice does not have $100, then we should not add 100 to Bob's account.

## Commiting a Transaction

Once you have made all the required changes to your database you can use the following to commit them

    connection.commit()

### Autocommit

If you would prefer for every command to have immediate effect on the database then use the following to autocommit all changes

    connection.autocommit = True

## Rolling back a Transaction

If you have made some changes but would like would like to abort then you can rollback to the last transaction point by using

    connection.rollback()
    
This is often required after you receive the following error 

    InternalError: current transaction is aborted, commands ignored until end of transaction block
    
## Commiting our Previous Changes (a complete example)

In [21]:
from psycopg2.extras import execute_values

# First rollback any changes you've made so far
connection.rollback()

# Get a cursor
cursor = connection.cursor()

# CREATE USER TABLE
create_qry = """CREATE TABLE IF NOT EXISTS users (
                  id integer NOT NULL,
                  username varchar NOT NULL,
                  role varchar NOT NULL,
                  PRIMARY KEY (id)
                );"""
cursor.execute(create_qry)

# INSERT USERS
insert_qry = "INSERT INTO users (id, username, role) VALUES %s ON CONFLICT DO NOTHING "

data = [
    ('1', 'Kelvin', 'Tutor'),
    ('2', 'Tina', 'Tutor'),
    ('3', 'Jess', 'Tutor'),
    ('4', 'Jie', 'Lecturer')
]

execute_values(cursor, insert_qry, data)

# COMMIT YOUR WORK
# to ensure and finish youe transcation
connection.commit()

cursor.close()

# What have we done?

1. Connected to a particular Database on a Server
2. Created a Table in the Database
3. Inserted data into the Table


<img width=700px src="img/overview.pdf">

# Connections

Most databases limit the number of open connections. If you have opened too many you might be unable to reconnect. In this case you need to go to ElephantSQL and terminate all current connections.

# Retrieving Data

To retreieve data from a table you use the SELECT command.

### Every Item in the Table

Use the asterisk to retrieve every column of data from a table.

``` mysql
SELECT *
FROM users
```

|id	|username |role |
|:--- |:---|:---|
|1 |Kelvin |Tutor |
|2 |Tina |Tutor |
|3 |Jess |Tutor|
|4 |Jie |Lecturer|

#### Fetching Results

Executing a query does not actually return any results. We need to specifically ask for the results. We can retrieve results:
- one a time using `cursor.fetchone()`
- all at once using `cursor.fetchall()`

In [26]:
cursor = connection.cursor()

select_qry = "SELECT * FROM users"

# reading query will store the data into this cursor object
cursor.execute(select_qry)

#Retrieve first result
row = cursor.fetchone()
print(row)

# # Retrieve first result
# while True:
#     row = cursor.fetchone()
#     print(row)
#     if row == None:
#         break

cursor.close()

(4, 'Jie', 'Lecturer')

In [27]:
cursor = connection.cursor()

# fetchone is for extracting 1 data at once!
# this is for reading everything from the table !
select_qry = "SELECT * FROM users"

# 1. sending this query to your data set in server
# 2. return the data from your server storing in your python UI
cursor.execute(select_qry)

# Retrieve results one by one from the curosr
# row = cursor.fetchone()
# print(row)
while True:
    row = cursor.fetchone()
    if row == None:
        break
    print(row)

(4, 'Jie', 'Lecturer')
(2, 'Tina', 'Lectuer')
(1, 'Kelvin', 'Tutor')
(3, 'Jess', 'Tutor')
(5, 'Chris', 'Tutor')

In [28]:
# fetchall to extract all the data at once 
cursor = connection.cursor()

# * means everything
select_qry = "SELECT * FROM users"

cursor.execute(select_qry)

# Retrieve all results
print(cursor.fetchall())

cursor.close()

[(4, 'Jie', 'Lecturer'), (2, 'Tina', 'Lectuer'), (1, 'Kelvin', 'Tutor'), (3, 'Jess', 'Tutor'), (5, 'Chris', 'Tutor')]

#### Getting column names (OPTIONAL)

If you used `*` to select columns then every column is returned, but psycopg2 doesn't embed the column names in the results. To view the column names you can use the following:

In [34]:
cursor.description?

In [33]:
cursor = connection.cursor()

# select_qry_all = "SELECT * FROM users"
select_qry_partial = "SELECT role, username FROM users"

cursor.execute(select_qry_partial)

# cursor.description: is to get the table column list
# for column_details in cursor.description: retrieve everything from that tuple by a for loop
# restore column_details.name is to get the name of column_details.name

column_names = [column_details.name for column_details in cursor.description]

# # this is a breakdown version
column_names = []
for column_details in cursor.description:
    column_names.append(column_details.name)


# print(column_names)
print(cursor.fetchall())

[('Lecturer', 'Jie'), ('Lectuer', 'Tina'), ('Tutor', 'Kelvin'), ('Tutor', 'Jess'), ('Tutor', 'Chris')]

# Pandas Integration

<div style="margin-bottom: 0px;"><img width=20 style="display: block; float: left;  margin-right: 20px;" src="img/docs.png"> <h3 style="padding-top: 0px;">Documentation - Pandas read_sql</h3></div>
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_sql.html


In Python it is easier to deal with our data as a Pandas DataFrame. Fortunately Pandas comes with a helper function to give us a DataFrame from an SQL query.

`read_sql` does the following:
1. Executes the SQL query
2. Fetches all the results
3. Converts the results into a DataFrame

In [36]:
import pandas.io.sql as psql

results_df = psql.read_sql("SELECT * FROM users", connection)

# results_df
results_df_id_role = psql.read_sql("SELECT id, role FROM users", connection)

print(results_df_id_role)

# read_sql is to warp your sql data to a pandas dataframe!
print(type(results_df_id_role))

   id      role
0   4  Lecturer
1   2   Lectuer
2   1     Tutor
3   3     Tutor
4   5     Tutor
<class 'pandas.core.frame.DataFrame'>

In [37]:
psql.read_sql?

# Customising Retrieval

### Particular Columns of a Table

If you want a particular set of columns from a table you can modify the select criteria. Here I only ask for the username and role columns. The id column is not part of the results.

``` mysql
SELECT username, role
FROM users
```

In [52]:
select_qry = "SELECT username, role FROM users"

results_df = psql.read_sql(select_qry, connection)

results_df

  username      role
0     Tina     Tutor
1      Jie  Lecturer
2     Jess  Lecturer
3   Kelvin     Tutor

### Conditional Query

Usually we want to find a section of the data where a condition is satisfied. For example I want to find all the tutors. You must add the WHERE clause to your SELECT query.

``` mysql
SELECT *
FROM users
WHERE role = 'Tutor'
```

In [39]:
# where condition is for giving the criteria to select!
select_qry = "SELECT username, role from users WHERE role='Tutor'"

results_df = psql.read_sql(select_qry, connection)

results_df

  username   role
0   Kelvin  Tutor
1     Jess  Tutor
2    Chris  Tutor

### Limiting Number of Rows

If you are only interested in the first $n$ rows of results you may use the LIMIT clause. For example I only want the first $2$ rows.

``` mysql
SELECT *
FROM users
WHERE role = 'Tutor'
LIMIT 2
```

In [34]:
# LIMIT IS TO LIMIT THE ROW NUMBERS
select_qry = "SELECT * FROM users WHERE role = 'Tutor' LIMIT 2"

results_df = psql.read_sql(select_qry, connection)

results_df

   id username   role
0   1   Kelvin  Tutor
1   2     Tina  Tutor

### Sorting Results

Apart from criteria you may also want to sort your results. In this case I am going to sort by id. Additionally you can specify the sort direction as either ASC or DESC.

``` mysql
SELECT *
FROM users
WHERE role = 'Tutor'
ORDER BY id DESC
```

In [41]:
# ORDER BY IS TO sort with asc or desc
select_qry = "SELECT * FROM users WHERE role = 'Tutor' ORDER BY id ASC"

results_df = psql.read_sql(select_qry, connection)

results_df

   id username   role
0   1   Kelvin  Tutor
1   3     Jess  Tutor
2   5    Chris  Tutor

In [42]:
# try to select all the people that role is tutor and order by acs with their id
# order is "ORDER BY"!

### Updating Data

Changing data is straightforward with the UPDATE query. You simply specify the table to change (UPDATE), the columns to change (SET) and the rows that should be affected (WHERE).

If you do not specify a WHERE clause then every row will be changed.

In this example I will change Stephen's role from tutor to Lecturer.

**NOTE** When using SQLFiddle you need to put this query in the schema editor. Put a SELECT all query in the query editor.

``` mysql
UPDATE users
SET role = 'Lecturer'
WHERE username = 'Stephen';
```

In [43]:

select_qry = "SELECT * FROM users"

results_df = psql.read_sql(select_qry, connection)

results_df

   id username      role
0   4      Jie  Lecturer
1   2     Tina   Lectuer
2   1   Kelvin     Tutor
3   3     Jess     Tutor
4   5    Chris     Tutor

In [44]:
# UPDATE is to write the value to data instance
# SET is to update specific column
# WHERE is to find the row I want to update
update_qry = "UPDATE users SET role = 'Lectuer' WHERE username = 'Kelvin'"

cursor.execute(update_qry)

# Make sure to commit your changes
connection.commit()

In [45]:
# Retrieve all results
select_qry = "SELECT username, role FROM users"
results_df = psql.read_sql(select_qry, connection)
results_df

  username      role
0      Jie  Lecturer
1     Tina   Lectuer
2     Jess     Tutor
3    Chris     Tutor
4   Kelvin   Lectuer

### Deleting Data

Deleting is similar to updating, except you do not have to specify anything to change. The row or rows that match the WHERE clause will get removed from the table.

**NOTE** When using SQLFiddle you need to put this query in the schema editor. Put a SELECT all query in the query editor.

``` mysql
DELETE FROM users
WHERE username = 'Kelvin';
```

In [46]:
# delete from is the key word to start the delete
# where the condition I try to find the row
# delete data
# using where condition
delete_qry = "DELETE FROM users WHERE username = 'Kelvin'"

cursor.execute(delete_qry)

# Make sure to commit your changes
connection.commit()

In [47]:
# Retrieve all results
select_qry = "SELECT username, role FROM users"
results_df = psql.read_sql(select_qry, connection)
results_df

  username      role
0      Jie  Lecturer
1     Tina   Lectuer
2    Chris     Tutor

# Relational Databases

A key feature of databases is their ability to model relational structure. Objects have relationships such as one-to-one, one-to-many and many-to-many.

Following our previous example of teaching staff, it doesn't make sense that a staff memmber has one role. Most staff have many roles. The previous database structure with a single table doesn't accomodate this one-to-many relationship.

To accomodate the one-to-many relationship we need two tables:
- Users: holds unique information about the user
- Roles: holds information about the role for a user

To link the role to a user we use a "foreign key". This is a value that is linked to a value in another table. In this example we want the foreign key in the role table to be the staff id in the staff table.

<img width=500px src="img/relational.pdf">

### Create Staff Table

``` mysql
CREATE TABLE IF NOT EXISTS staff (
  staff_id integer NOT NULL,
  username varchar NOT NULL,
  PRIMARY KEY (staff_id)
);

INSERT INTO staff (staff_id, username) VALUES
  ('1', 'Kelvin'),
  ('2', 'Tina'),
  ('3', 'Jess'),
  ('4', 'Jie'),
  ('5', 'David');
```

In [64]:
connection.rollback()

In [48]:
from psycopg2.extras import execute_values

# Get a cursor
cursor = connection.cursor()

# CREATE USER TABLE
create_qry = """CREATE TABLE IF NOT EXISTS staff (
                  staff_id integer NOT NULL,
                  username varchar NOT NULL,
                  PRIMARY KEY (staff_id)
                );"""
cursor.execute(create_qry)

# INSERT USERS
insert_qry = "INSERT INTO staff (staff_id, username) VALUES %s ON CONFLICT DO NOTHING"

data = [
  ('1', 'Kelvin'),
  ('2', 'Tina'),
  ('3', 'Jess'),
  ('4', 'Jie'),
  ('5', 'David')
]

execute_values(cursor, insert_qry, data)

# COMMIT YOUR WORK
connection.commit()

cursor.close()

In [49]:
cursor = connection.cursor()
select_qry = "SELECT * FROM staff"
results_df = psql.read_sql(select_qry, connection)
results_df

   staff_id username
0         1   Kelvin
1         2     Tina
2         3     Jess
3         4      Jie
4         5    David

### Create Roles Table

``` mysql
CREATE TABLE IF NOT EXISTS roles (
  role_id integer NOT NULL,
  staff_id integer NOT NULL,
  role varchar,
  unit varchar,
  PRIMARY KEY (role_id),
  FOREIGN KEY (staff_id) REFERENCES staff(staff_id)
);

INSERT INTO roles (role_id, staff_id, role, unit) VALUES
  ('1', '1', 'Tutor', 'BUSS6002'),
  ('2', '2', 'Tutor', 'BUSS6002'),
  ('3', '3', 'Lecturer', 'BUSS6002'),
  ('4', '3', 'Tutor', 'BUSS6002'),
  ('5', '4', 'Tutor', 'BUSS6002'),
  ('6', '1', 'Tutor', 'QBUS6810');
```

In [66]:
from psycopg2.extras import execute_values

# Get a cursor
cursor = connection.cursor()

# FOREIGN KEY (staff_id) REFERENCES staff(staff_id)
# this FK is linked from roles table to staff table with the columns staff ID !

# CREATE USER TABLE
create_qry = """CREATE TABLE IF NOT EXISTS roles (
                  role_id integer NOT NULL,
                  staff_id integer NOT NULL,
                  role varchar,
                  unit varchar,
                  PRIMARY KEY (role_id),
                  FOREIGN KEY (staff_id) REFERENCES staff(staff_id)
                );"""
cursor.execute(create_qry)

# fK
# FOREIGN KEY (column name) REFERENCES table name (column name)

# INSERT USERS
insert_qry = "INSERT INTO roles (role_id, staff_id, role, unit) VALUES %s  ON CONFLICT DO NOTHING"

data = [
  ('1', '1', 'Tutor', 'BUSS6002'),
  ('2', '2', 'Tutor', 'BUSS6002'),
  ('3', '3', 'Lecturer', 'BUSS6002'),
  ('4', '3', 'Tutor', 'BUSS6002'),
  ('5', '4', 'Tutor', 'BUSS6002'),
  ('6', '1', 'Tutor', 'QBUS6810')
]

execute_values(cursor, insert_qry, data)

# COMMIT YOUR WORK
connection.commit()

cursor.close()

In [50]:
cursor = connection.cursor()
select_qry = "SELECT * FROM roles"
results_df = psql.read_sql(select_qry, connection)
results_df

   role_id  staff_id      role      unit
0        1         1     Tutor  BUSS6002
1        2         2     Tutor  BUSS6002
2        3         3  Lecturer  BUSS6002
3        4         3     Tutor  BUSS6002
4        5         4     Tutor  BUSS6002
5        6         1     Tutor  QBUS6810

### Joins

To match up data across foreign key relationships you can use the join command

<img src="img/joins.png" width=600px>
*image from https://www.w3schools.com/sql/sql_join.asp*

``` mysql
SELECT staff.username, roles.role, roles.unit
FROM roles
INNER JOIN staff ON staff.staff_id = roles.staff_id
```

|username| role | unit |
|:--- |:---|:--- |:---|
|Kelvin | Tutor | BUSS6002 |
|Kelvin | Tutor | QBUS6810 |
|Harrison | Tutor | BUSS6002 |
|Stephen | Lecturer | BUSS6002 |
|Stephen | Tutor | BUSS6002 |
|Prasad | Tutor | BUSS6002 |

#### Inner Join Notes

Notice that David is missing! He is not present in both tables.

In [68]:
# inner join is just intersection!
# 3 columns: staff.username, roles.role, roles.role
# INNER JOIN 
# with a key name staff_id
cursor = connection.cursor()
join_qry = """SELECT staff.username, roles.role, roles.unit
                FROM roles
                INNER JOIN staff ON staff.staff_id = roles.staff_id"""

results_df = psql.read_sql(join_qry, connection)
results_df

# outer join, left join, right join!!

INNER JO
# https://stackoverflow.com/questions/38549/what-is-the-difference-between-inner-join-and-outer-join

  username      role      unit
0   Kelvin     Tutor  BUSS6002
1     Tina     Tutor  BUSS6002
2     Jess  Lecturer  BUSS6002
3     Jess     Tutor  BUSS6002
4      Jie     Tutor  BUSS6002
5   Kelvin     Tutor  QBUS6810

In [51]:
cursor = connection.cursor()
join_qry = """SELECT staff.username, roles.role, roles.unit
FROM roles FULL OUTER JOIN staff ON (staff.staff_id = roles.staff_id)"""

cursor.execute(join_qry)
cursor.fetchall()

[('Kelvin', 'Tutor', 'BUSS6002'),
 ('Tina', 'Tutor', 'BUSS6002'),
 ('Jess', 'Lecturer', 'BUSS6002'),
 ('Jess', 'Tutor', 'BUSS6002'),
 ('Jie', 'Tutor', 'BUSS6002'),
 ('Kelvin', 'Tutor', 'QBUS6810'),
 ('David', None, None)]

<div style="margin-bottom: 30px;"><img width=48 style="display: block; float: left;  margin-right: 20px;" src="img/question-mark-button.png"> <h3 style="padding-top: 15px;">Exercise 2 - Joins</h3></div>

1. What is the result of "OUTER JOIN staff ON staff.staff_id = roles.staff_id" for user David and why?

# SQLite (Local File Databases)

Below we illustrate how you can use the sqlite3 library to connect and query a local SQLite database. An SQLite database is a self contained database stored in a normal file on your hard disk. It is commonly used for small software projects and most mobile apps use a local SQlite database to store their data!

In [77]:
import sqlite3

conn = sqlite3.connect("staff.db")

c = conn.cursor()

c.execute("SELECT roles.role, roles.unit FROM roles")

c.fetchall()

OperationalError: no such table: roles

We can integrate sqlite and pandas to read query results directly into a DataFrame

In [26]:
import pandas as pd

conn = sqlite3.connect("staff.db")

roles_df = pd.read_sql("SELECT roles.role, roles.unit FROM roles", conn)

roles_df.head()

       role      unit
0     Tutor  BUSS6002
1     Tutor  BUSS6002
2  Lecturer  BUSS6002
3     Tutor  BUSS6002
4     Tutor  BUSS6002

Joins are also supported

In [27]:
query_str = "SELECT staff.username, roles.role, roles.unit FROM roles INNER JOIN staff ON staff.staff_id = roles.staff_id"

joined_df = pd.read_sql(query_str, conn)

joined_df.head()

   username      role      unit
0    Kelvin     Tutor  BUSS6002
1  Harrison     Tutor  BUSS6002
2   Stephen  Lecturer  BUSS6002
3   Stephen     Tutor  BUSS6002
4    Prasad     Tutor  BUSS6002